To do:
- scrape: https://en.wikipedia.org/wiki/Gymnastics_at_the_2020_Summer_Olympics_%E2%80%93_Women%27s_artistic_qualification

- Individual Rankings:
    - https://www.gymnastics.sport/site/rankings/ranking_wag.php
    - https://en.wikipedia-on-ipfs.org/wiki/FIG_World_Rankings

# Top Women:

## Sunisa LEE
- UE 15.300
- BB 13.833

## Jade CAREY
- FX 14.366
- VT 15.200
- VT2 14.300

## Mykayla SKINNER
- VT1 15.033
- VT2 14.800

## Joscelyn ROBERSON
- FX 13.300
- VT1 14.233
- VT2 13.933
- BB 13.233


## Simone BILES
- BB 14.0


## Zoe MILLER
- UB 14.633

## Shilese JONES
- UB 14.766

# Men

## Brody MALONE  
- HB 14.800
## Curran PHILLIPS  
- PB 15.500
## Stephen NEDOROSCIK 
- PH 15.233
## Joshua Andrew KARNES 
- VT 14.733
## Asher HONG 
- VT1 15.450

In [3]:
import pandas as pd
import numpy as np

In [8]:
# Zoe MILLER" height unknown
data = {
  "Name": ["Sunisa LEE", "Jade CAREY", "Mykayla SKINNER", "Joscelyn ROBERSON", "Simone BILES", "Zoe MILLER", "Shilese JONES"],
    "DOB": ["03-09-2003", "01-01-2000",  "01-01-1996", "01-01-2006", "03-14-1997", "01-01-2005", "01-01-2002"],
    "Height": [5.0, 5.2, 5.1, 4.8, 4.8, 5.0, 5.3]
}
#load data into a DataFrame object:
df = pd.DataFrame(data)
df

                Name         DOB  Height
0         Sunisa LEE  03-09-2003     5.0
1         Jade CAREY  01-01-2000     5.2
2    Mykayla SKINNER  01-01-1996     5.1
3  Joscelyn ROBERSON  01-01-2006     4.8
4       Simone BILES  03-14-1997     4.8
5         Zoe MILLER  01-01-2005     5.0
6      Shilese JONES  01-01-2002     5.3

## Majority of female gymnasts in the modern era in the Olympics are between ages 16 - 22

In [6]:
data = {
  "Name": ["Brody MALONE", "Curran PHILLIPS", "Stephen NEDOROSCIK", "Joshua Andrew KARNES", "Asher HONG"],
    
}

#load data into a DataFrame object:
df1 = pd.DataFrame(data)
df1

                   Name
0          Brody MALONE
1       Curran PHILLIPS
2    Stephen NEDOROSCIK
3  Joshua Andrew KARNES
4            Asher HONG